---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceConditionType
source: html/dcfb602c-fc05-f492-5e70-7c0a7c8a325b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceConditionType Property

"Condition Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceConditionType { get; }
```